app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.find_by_id(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      if @artist.songs.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]